# Chapter 5: Getting Started with Pandas

### Introduction to pandas Data Structure

#### Series

Series = one-dim array-like object containing an array of data and an associated array of data labels, called its index.

In [3]:
from pandas import DataFrame, Series
import pandas as pd
import json
import numpy as np

obj = Series([4,7,-5,3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# Get the array representation

obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
# Get the index object

obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
# Create a Series with an index identifying each data point:

obj2 = Series([4,7,-5,3], index = ['d', 'b', 'a', 'c'])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Compared with regular Numpy array, can use values in the index when selecting single values or a set of values:

In [10]:
obj2['a']

-5

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [12]:
# Numpy array operations, such as filtering with a boolean array, will preseve the index-value link:

obj2[obj2 >0]

d    4
b    7
c    3
dtype: int64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values.
Can create a Series from data contained in a Python dict by passing the dict:

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

sdata

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [17]:
obj3 = Series(sdata)

obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

When only passing a dict, the index in the resulting Series will have the dict's keys in sorted order

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = Series(sdata, index = states) # provides the values in sdata associated to the specified indexes

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

No value for "California" was not found i.e. NaN (not a number) indicating NA values.

isnull() and notnull() should be used to detect missing data:

In [21]:
obj4.isnull() # instance method

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj4.notnull() # instance method

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
# Or panda functions

pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series automaticaly aligns differently-indexed data in arithmic operations:

In [25]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a name attribute:

In [26]:
obj4.name = 'population'

obj4.index.name = 'state'

In [27]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series' index can be altered in place by assignment

In [28]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

A DataFrame represents a tabular, speadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type. 

The DataFrame has both a row and a column index. It can be thought of a dict of Series. 

One of the most common way to construct a DataFrame is from a dict of equal-length lists or Numpy arrays:

In [32]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = DataFrame(data)

In [33]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [34]:
# Specify the sequence of columns

DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

As with Series, if pass a column that isn't contained in data, it will appear with NA values in the result:

In [38]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

A column in in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [40]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [41]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

Rows can also be retrived by position or name by a couple of methods, such as the ix indexing field

In [43]:
frame2.ix['three'] # using the index name

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [46]:
frame2.ix[2] # using the index

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assigment. For example, the empty "debt" column could be assigned a scalar value or an array value

In [48]:
frame2['debt'] = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [53]:
frame2['debt'] = np.arange(5.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

When assigning lists of arrays to a column, the value's lenght must match the length of the DataFrame. I assign a Series, it will be instead conformed exactly the to the DataFrame's index, inserting missing values in any whole.

In [55]:
val = Series([-1.2, -1.5, -1.7], index =['two', 'four', 'five'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Assigning a column that doesn't exist will create a new column

In [62]:
frame2['eastern'] = frame2.state == 'Ohio'

frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

The del keyword will delete columns as with a dict:

In [63]:
del frame2['eastern']

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Another common form of data is a nested dict of dicts format:

In [69]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
      }

If passed to DataFrame, it will interpret the outer dict keys as the columns and the inner keys as the row indiced:

In [70]:
frame3 = DataFrame(pop)

frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

Transpose the result:

In [71]:
frame3.transpose()

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [72]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

The keys in the inner dicts are unioned and sorted to form the index in the result. This isn't true if an explicit index is specified:

In [73]:
DataFrame(pop, index = [2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [76]:
frame3['Ohio'][:-1] # tout sauf la dernière ligne

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [77]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

Set the DataFrame's index and columns name attributes:

In [84]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

Like Series, the values attribute returns the data contained in the DataFrame as a 2D ndarray:

In [86]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [88]:
frame3.values[1,:2] # if want to return the values inside of the dataframe

array([ 2.4,  1.7])

### Essential Functionnality

#### Reindexing

Create a new object with the data conformed to a new index.

In [92]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex rearranges the data accordig to the new index, introducing missing values if any index values were not already present

In [93]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [94]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value =0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. Using a method such as ffill foward fills the value:

In [95]:
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])

obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

ffill or pad: Fill (or carry) values forward

bfill or backfill: Fill (or carry) values backward

With DataFrame, reindex can alter either the (row) index, columns, or both. When passed just a sequence, the rows are reindexed in the results:

In [97]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'],
                  columns = ['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [98]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindexed using the columns keyword:

In [103]:
state = ['Texas', 'Utah', 'California']

frame.reindex(columns = state)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Both can be reindexed in one shot, though interpolation will only apply row-wise (axis 0):

In [104]:
frame.reindex(index = ['a', 'b', 'c', 'd'], method = 'ffill', columns = state) # if index didn't exist yet, fill with previous

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Reindexing can be done more succinctly by label-indexing:

In [107]:
frame.ix[['a', 'b', 'c', 'd'], states]

   California  Ohio  Oregon  Texas
a         2.0   0.0     NaN    1.0
b         NaN   NaN     NaN    NaN
c         5.0   3.0     NaN    4.0
d         8.0   6.0     NaN    7.0

#### Dropping entries from an axis

The drop method will return a new object with the indicated value or values deleted from an axis

In [109]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [111]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis;

In [112]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio', 'Colorado', 'Utha', 'New York'],
                columns = ['one', 'two', 'three', 'four']
                )

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utha        8    9     10    11
New York   12   13     14    15

In [113]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utha        8    9     10    11
New York   12   13     14    15

In [116]:
data.drop('two', axis = 1) # axis = 1 i.e. column

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utha        8     10    11
New York   12     14    15

In [117]:
data.drop(['two', 'four'], axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utha        8     10
New York   12     14

#### Indexing, Selection, and filtering

##### Series

Analogous to NumPy array indexing, except can use the Series's index value instead of only integers.

In [119]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [120]:
obj['b']

1.0

In [121]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [122]:
obj[1]

1.0

In [123]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [124]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [126]:
obj[obj>= 2]

c    2.0
d    3.0
dtype: float64

Slicing with lables behave differently than normal Python Slicing in that the endpoint is inclusive:

In [127]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Setting:

In [128]:
obj['b':'c'] = 5

obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

##### DataFrame

In [129]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data['two'] # Une colonne

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [131]:
data[['three', 'one']] # Deux colonnes

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [132]:
data[:2] # Deux premières lignes

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [133]:
data[data['three'] > 5] # Slicing with boolean

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [135]:
data[data <5] = 0 # Set value 0 to values < 5 

data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Special indexing field ix enables to select a subset of the rows and columns from a DataFrame with NumPy-like notation plus axis labels.

In [136]:
data.ix['Colorado', ['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [138]:
data.ix[['Colorado', 'Utah'], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [139]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [140]:
data.ix[data.three > 5, :3] #[rows, columns]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

When adding together objets, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.

In [143]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])

s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [144]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [145]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [146]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal alignment introduces NA values in the indice that don't overlap. Missing values propagate in arithmetic computations.

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [150]:
df1 = DataFrame(np.arange(9).reshape((3,3)), # 3 rows, 3 columns
               columns = list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])

df2 = DataFrame(np.arange(12.).reshape((4,3)), # 4 rows, 3 columns
               columns = list('bde'),
               index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [151]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [152]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Adding these together returns a DataFrame whose index and columns are the unions of the ones in each DataFrame

In [153]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

Fill with a special value, like 0, when an axis label is found in one object but not the other

In [154]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns = list('abcd'))

df2 = DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))

In [155]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [156]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [157]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, you pass df2 and an argument to fill_value:

In [158]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Can also specify a different fill value when reindexing a Series or DataFrame

In [160]:
df1.reindex(columns = df2.columns, fill_value = 0) # replace Nas in new column ('e') with value of 0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operation between DataFrame and Series

Broadcasting:

In [162]:
arr = np.arange(12.).reshape((3,4))

arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [163]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [164]:
arr - arr[0] # substract first row to each row

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

Operations between a DataFrame and a Series:

In [166]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

series = frame.ix[0]

In [167]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [168]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Arithmetic between DataFrame and Series matches the index of the Series on the DataFrame's columns, broadcasting down the rows:

In [169]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found on either the DataFrame's columns or the Series's index, the objects will be reindexed to form the union:

In [170]:
series2 = Series(range(3), index = ['b', 'e', 'f'])

In [171]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If want to instead broadcast over the columns, matching on the rows, have to use one of the arithmetic methods.

In [172]:
series3 = frame['d']

# Substract series3 to frame

frame.sub(series3, axis =0) # axis = axis to match on (in this case row)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

NumPy ufuncs work with pandas objects

In [175]:
frame = DataFrame(np.random.randn(4,3), columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

               b         d         e
Utah   -0.606865 -0.216403 -0.649536
Ohio    1.167380  1.826709 -0.230145
Texas  -1.691745  0.217755  0.071593
Oregon  1.023151  0.119238 -0.050112

In [176]:
np.abs(frame)

               b         d         e
Utah    0.606865  0.216403  0.649536
Ohio    1.167380  1.826709  0.230145
Texas   1.691745  0.217755  0.071593
Oregon  1.023151  0.119238  0.050112

Another frequent operation is applying a function on 1D arrays to each column or row. 
DataFrame's apply method does exactly this:

In [177]:
f = lambda x: x.max() - x.min()

In [178]:
frame.apply(f)

b    2.859125
d    2.043112
e    0.721129
dtype: float64

In [179]:
frame.apply(f, axis=1)

Utah      0.433133
Ohio      2.056854
Texas     1.909500
Oregon    1.073263
dtype: float64

	          b	        d	       e	      Max - Min
Utah	-0.606865	-0.216403	-0.649536	  0.433133
Ohio	 1.16738	 1.826709	-0.230145	  2.056854
Texas	-1.691745	 0.217755	 0.071593	  1.9095
Oregon	 1.023151	 0.119238	-0.050112	  1.073263

Max-Min	 2.859125	 2.043112	 0.721129

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

The function passed to apply need not return a scalar value, it can also return a Series with multiple values:

In [181]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

frame.apply(f) # return min and max of each column

            b         d         e
min -1.691745 -0.216403 -0.649536
max  1.167380  1.826709  0.071593

### Sorting and ranking

In [183]:
obj = Series(range(4), index = ['d', 'a', 'b', 'c'])

obj

d    0
a    1
b    2
c    3
dtype: int32

In [184]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

With DataFrame, can sort by index on either axis:

In [185]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'],
                  columns = ['d', 'a', 'b', 'c'])

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [186]:
frame.sort_index() # rows

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [187]:
frame.sort_index(axis = 1) # columns

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

Can be sorted in descending order

In [189]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series using its values, use its sort_values method:

In [190]:
obj = Series([4,7,-3,2])

In [194]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default

In [195]:
obj = Series([4, np.nan, 7, np.nan,-3,2])

In [196]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

On DataFrame, can sort by the values in one or more columns. To do so, pass one or more column names to the by option.

In [197]:
frame = DataFrame({'b': [4,7,-3,2], 'a': [0,1,0,1]})

frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [198]:
frame.sort_values(by = 'b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

Ranking: Compute numerical data ranks (1 through n) along axis. Equal values are assigned a rank that is the average of the ranks of those values

By default, rank breaks ties by assigning each group the mean rank:

In [204]:
obj = Series([1, 5, 8, 10])

obj

0     1
1     5
2     8
3    10
dtype: int64

In [203]:
obj.rank()

0    3.0
1    4.0
2    1.0
3    5.0
4    2.0
dtype: float64

Ranks can also be assigned according to the order they're observed in the data:

In [206]:
obj.rank(method = 'first')

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

Can rank in descending order, too:

In [209]:
obj.rank(ascending = False, method = 'max')

0    4.0
1    3.0
2    2.0
3    1.0
dtype: float64

DataFrame can compute rank over the rows or the columns

In [4]:
frame = DataFrame({'b':[4.3,7,-3,2], 'a': [0,1,0,1],
                  'c': [-2,5,8,-2.5]})

frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [212]:
frame.rank(axis = 1) # Rank by row

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [6]:
frame.rank(axis = 0, method = 'first') # Rank by column

     a    b    c
0  1.0  3.0  2.0
1  3.0  4.0  3.0
2  2.0  1.0  4.0
3  4.0  2.0  1.0

### Axis indexes with duplicate values

In [7]:
obj = Series(range(5), index =['a', 'a', 'b', 'c', 'd'])

obj

a    0
a    1
b    2
c    3
d    4
dtype: int32

is_unique tells if wether its values are unique or not:

In [9]:
obj.index.is_unique

False

Data selection behaves differently with duplicates. Indexing a value with multiple entries returns a Series while single entries returns a scalar value:

In [10]:
obj[['a', 'c']]

a    0
a    1
c    3
dtype: int32

In [11]:
obj['a']

a    0
a    1
dtype: int32

In [12]:
obj['c']

3

The same logic extends to indexing rows in a DataFrame:

In [13]:
df = DataFrame(np.random.randn(4,3), index = ['a', 'a', 'b', 'b'])

df

          0         1         2
a  0.341394  0.225757  0.816316
a -0.126994  0.129854 -1.499073
b -0.329846 -1.039586  0.029536
b  1.245422  1.114082  1.226621

In [14]:
df.ix['b']

          0         1         2
b -0.329846 -1.039586  0.029536
b  1.245422  1.114082  1.226621

## Summarizing and Computing Descriptive Statistics

Pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of value from the rows or columns of a DataFrame. They are built from the ground up to exclude missing data.

In [48]:
df = DataFrame([[1.4, np.nan], [7.1,-4.5],
               [np.nan, np.nan], [0.75, -1.3]],
               index = ['a', 'b', 'c', 'd'],
               columns = ['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame's sum method returns a Series containing column sums:

In [16]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis = 1 sums over the rows instead:

In [17]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are skipped unless the entire slice (row or column in this case) is NA. This can be disabled using the skipna option:

In [19]:
df.sum(axis = 1, skipna = False) # skipna is True by default

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

Idxmin and idxmax returns indirect statistics like the index value where the minimum or maximum values are attained. Reduction methods

In [20]:
df.idxmin() # index of row corresponding to the minimum of each column

one    d
two    b
dtype: object

In [21]:
df.idxmax() # index of row corresponding to the maximum of each column

one    b
two    d
dtype: object

Other methods are accumulations:

In [22]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Some methods are neither reductions nor accumulations. For instance, describe produces multiple summary statistics in one shot:

In [31]:
df.describe() # Can't calculate percentiles because NaN values

C:\Users\mdeleseleuc\AppData\Local\Continuum\Anaconda3\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

In [53]:
df.fillna(0).describe() # replace NaN with 0s

            one       two
count  4.000000  4.000000
mean   2.312500 -1.450000
std    3.242523  2.123676
min    0.000000 -4.500000
25%    0.562500 -2.100000
50%    1.075000 -0.650000
75%    2.825000  0.000000
max    7.100000  0.000000

In [54]:
df.dropna().describe() # drop NaN values (note: seems to be dropping the complete row)

            one       two
count  2.000000  2.000000
mean   3.925000 -2.900000
std    4.490128  2.262742
min    0.750000 -4.500000
25%    2.337500 -3.700000
50%    3.925000 -2.900000
75%    5.512500 -2.100000
max    7.100000 -1.300000

On non-numeric data, describe produces alternate summary statistics:

In [55]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [56]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### Unique Values, Value Counts, and Membership

Another class of related methods extracts information about the values contained in a one-dimensional Series.

##### Personal exercice: create a Series of random letters

In [70]:
Lst = []

for i in range(9):
    x = random.choice('abcdefghijklmnopqrstuvwyz')
    Lst.append(x)

print(Lst)

['h', 'm', 't', 'i', 'b', 'i', 'j', 'e', 'h']

In [71]:
obj = Series(Lst)

obj

0    h
1    m
2    t
3    i
4    b
5    i
6    j
7    e
8    h
dtype: object

**<font color='red'>unique</font>** : gives an array of the unique values in a Series

In [ ]:
# Note: don't run code

** **: Bold text
    
<font color='red'>strin</font>: color of string

In [72]:
uniques = obj.unique()

uniques

array(['h', 'm', 't', 'i', 'b', 'j', 'e'], dtype=object)

The returned values can be sorted in order:

In [78]:
uniques.sort()

uniques

array(['b', 'e', 'h', 'i', 'j', 'm', 't'], dtype=object)

value_counts() computes a Series containing value frequencies

In [77]:
obj.value_counts()

i    2
h    2
b    1
m    1
e    1
t    1
j    1
dtype: int64

If want results unsorted:

In [82]:
pd.value_counts(obj.values, sort = False)

j    1
t    1
h    2
i    2
e    1
m    1
b    1
dtype: int64

**<font color='red'>isin</font>** can be used to filter data:

In [84]:
obj[obj.isin(['h', 'm'])]

0    h
1    m
8    h
dtype: object

In some case, you may want to compute a histogram on multiple related columns in a DataFrame.

In [88]:
data = DataFrame({'Qu1': [1,3,4,3,4],
                 'Qu2': [2,3,1,2,3],
                 'Qu3': [1,5,2,4,4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Passing panda.value_counts() to this DataFrame's apply function gives:

In [90]:
result = data.apply(pd.value_counts).fillna(0)

result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### Handling Missing Data

<font color='red'>NaN</font>: Not a Number. Represent missing data. 

**None** value is also treated as NA.

In [95]:
string_data = Series(['aadvark', 'artichoke', np.nan, 'avocado'])

string_data[0] = None

In [96]:
string_data.isnull() # Identify the Null values

0     True
1    False
2     True
3    False
dtype: bool

In [104]:
string_data[string_data.isnull()] # Select the Null values

0    None
2     NaN
dtype: object

### Filtering Missing Data

<font color='red'>dropna</font>: Filter axis label based on wether values for each label have missing data

<font color='red'>fillna</font>: Fill in missing data with some value or using an interpolation method such as 'ffill'

<font color='red'>isnull</font>: Return like-type object containing boolean values indicating which values are missing/NA

<font color='red'>notnull</font>: Negation of isnull

In [99]:
from numpy import nan as NA

data = Series([1,NA,3.5,NA,7])

In [101]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [103]:
data[data.notnull()] # using boolean indexing

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, these are a bit more complex. May want to drop rows or columns which are all NA or just those containing an NAs. 

dropna by default drops any row containing a missing value:

In [106]:
data = DataFrame([[1.,6.5,3.], [1.,NA,NA],
                [NA,NA,NA], [NA,6.5,3.]])

cleaned = data.dropna()

In [109]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [110]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how = 'all' with drop rows that are all NA:

In [111]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Droppping columns in the same way is only a matter of passing axis=1

In [112]:
data[4] = NA # Add a 4th column with only NAs

In [113]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [114]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

If want to keep only rows containing a certain number of observation, can indicate it with the thresh argument:

In [132]:
df = DataFrame(np.random.randn(7,3))

df.ix[:4,1] = NA; df.ix[:2,2] = NA

In [117]:
df

          0         1         2
0  1.338083       NaN       NaN
1 -0.392615       NaN       NaN
2  1.019710       NaN       NaN
3 -0.113003       NaN  0.941182
4 -0.928521       NaN -0.007593
5 -1.045550 -0.868912  0.381762
6 -0.692221 -0.764089  1.172401

In [130]:
df.dropna(thresh=2) 

#thresh : int, default None
  # int value : require that many non-NA values
    
    # thresh=2: only keep rows with less then 2 NAs

          0         1         2
3 -0.113003       NaN  0.941182
4 -0.928521       NaN -0.007593
5 -1.045550 -0.868912  0.381762
6 -0.692221 -0.764089  1.172401

### Filling in Missing Data

Rather than filtering out missing data (and potentially discarding other data along with is), may want to fill in the "holes". 

Calling <font color='red'>fillnat</font> with a constant replaced missing values with that value

In [131]:
df.fillna(0)

          0         1         2
0  1.338083  0.000000  0.000000
1 -0.392615  0.000000  0.000000
2  1.019710  0.000000  0.000000
3 -0.113003  0.000000  0.941182
4 -0.928521  0.000000 -0.007593
5 -1.045550 -0.868912  0.381762
6 -0.692221 -0.764089  1.172401

Calling fillnat with a dict, you can use a different fill value for each column

In [133]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.806469  0.500000       NaN
1 -0.184439  0.500000       NaN
2 -0.132738  0.500000       NaN
3 -1.399903  0.500000 -0.170593
4  0.776601  0.500000 -0.849237
5  1.801333  0.761632 -0.102085
6  0.366474  1.189209  1.163069

<font color = 'blue'>fillna</font> returns a new object, but you can modify the existing object in place:

In [135]:
_ = df.fillna(0, inplace = True)

In [136]:
df

          0         1         2
0 -0.806469  0.000000  0.000000
1 -0.184439  0.000000  0.000000
2 -0.132738  0.000000  0.000000
3 -1.399903  0.000000 -0.170593
4  0.776601  0.000000 -0.849237
5  1.801333  0.761632 -0.102085
6  0.366474  1.189209  1.163069

Interpolation methods available for reindexing can be used with fillna:

In [137]:
df = DataFrame(np.random.randn(6,3))

df.ix[2:,1] = NA; df.ix[4:,2] = NA

In [138]:
df

          0         1         2
0  0.653408 -0.428456  2.529752
1 -1.664068 -1.700262  1.040957
2  1.506288       NaN  0.105819
3 -1.044047       NaN -0.714417
4 -0.934160       NaN       NaN
5  0.355762       NaN       NaN

In [140]:
df.fillna(method = 'ffill') # fill NA with previous row

          0         1         2
0  0.653408 -0.428456  2.529752
1 -1.664068 -1.700262  1.040957
2  1.506288 -1.700262  0.105819
3 -1.044047 -1.700262 -0.714417
4 -0.934160 -1.700262 -0.714417
5  0.355762 -1.700262 -0.714417

In [141]:
df.fillna(method = 'ffill', limit =2) # fill NA with previous rown; first two NAs only

          0         1         2
0  0.653408 -0.428456  2.529752
1 -1.664068 -1.700262  1.040957
2  1.506288 -1.700262  0.105819
3 -1.044047 -1.700262 -0.714417
4 -0.934160       NaN -0.714417
5  0.355762       NaN -0.714417

Can pass the <font color = 'blue'>mean</font> or <font color='blue'>median</font> value of a Series to fill the NAs:

In [142]:
data = Series([1., NA, 3.5, NA, 7])

In [145]:
_ = data.fillna(data.mean(), inplace = True)

data

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical Indexing

**<font color='red'>Hierarchical Indexing</font>** enable to have multiple (>=2) index levels on an axis. It provides a way to work with higher dimensional data in a lower dimensional form.

In [148]:
data = Series(np.random.randn(10),
               index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3,1, 2, 3,1, 2, 2, 3]])

In [149]:
data

a  1    0.539071
   2    0.385374
   3   -0.879905
b  1    1.099847
   2    0.806371
   3    0.373015
c  1   -1.409634
   2    1.473201
d  2   -1.300425
   3    0.260148
dtype: float64

This (above) correspond to a view of a Series with a MultiIndex as its index.

In [150]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [151]:
data['b']

1    1.099847
2    0.806371
3    0.373015
dtype: float64

In [152]:
data['b':'c']

b  1    1.099847
   2    0.806371
   3    0.373015
c  1   -1.409634
   2    1.473201
dtype: float64

In [153]:
data.ix[['b', 'd']]

b  1    1.099847
   2    0.806371
   3    0.373015
d  2   -1.300425
   3    0.260148
dtype: float64

Selection is even possible in some cases from a 'inner' level:

In [157]:
data[:,2] # Select value for index = 2 for each of the highest level

a    0.539071
b    1.099847
c   -1.409634
dtype: float64

In [158]:
data[:,1]

a    0.539071
b    1.099847
c   -1.409634
dtype: float64

Hierarchical indexing plays a critical role in reshaping data and group=based operations like forming a pivot table.

For exemple, this data could be rearranged into a DataFrame using its unstack method:

In [159]:
data.unstack()

          1         2         3
a  0.539071  0.385374 -0.879905
b  1.099847  0.806371  0.373015
c -1.409634  1.473201       NaN
d       NaN -1.300425  0.260148

The inverse operation of unstack() is stack()

In [160]:
data.unstack().stack()

a  1    0.539071
   2    0.385374
   3   -0.879905
b  1    1.099847
   2    0.806371
   3    0.373015
c  1   -1.409634
   2    1.473201
d  2   -1.300425
   3    0.260148
dtype: float64

With DataFrame, either axis can have a hierarchical index:

In [179]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a', 'a', 'b', 'b'], [1,2,1,2]],
                 columns = [['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

In [180]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

The hiearchical levels can have names. If so, these will show up in the console output (don't confuse the index names with the axis labels!):

In [181]:
frame.index.names = ['key1', 'key2']

frame.columns.names = ['state', 'color']

frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

With partial column indexing, can similarly select groups of columns:

In [182]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

A MultiIndex can be created by itself and then reused; the columns in the above DataFrame with level names could be created like this:

In [ ]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']],
                      names = ['state', 'color'])

### Reordering and Sorting Levels

At times will need to rearrange the order of the levels on an axis or sort the data by the values in one specific level. The <font color='blue'>swaplevel</font> takes two level numbers or names and returns a new object with the levels interchanged (but the data is otherwise unaltered)

In [184]:
frame.swaplevel('key1', 'key2') # swap levels in row

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [185]:
frame.swaplevel('state', 'color', axis = 1) # swap levels in columns

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

<font color='blue'>sortlevel</font> sorts the data (stably) using only the values in a single level.

In [186]:
frame.sortlevel(1) #sort by key 2

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [187]:
frame.sortlevel(0) # sort by key 1

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [188]:
frame.sortlevel('state', axis = 1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [189]:
frame.sortlevel('color', axis = 1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

### Summary Statistics by Level

Many descriptive and summary statistics on DataFrame and Series have a <font color='blue'>level</font> option in which

In [191]:
frame.sum(level= 'key2') # add 1s and 2s together (respective rows for 'a' and 'b')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [192]:
frame.sum(level = 'color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's Column

Not unusual to want use one or more columns from a DataFrame as the row index; alternatively, you may wish to move the row index into the DataFrame's columns.

In [195]:
frame = DataFrame({'a': range(7), 'b': range(7,0,-1),
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd':[0, 1, 2, 0, 1, 2, 3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

<font color='blue'>set_index</font> will create a new DataFrame using one or more of its columns as the index:

In [197]:
frame2 = frame.set_index(['c', 'd'])

frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default, the columns are removed from the DataFrame, though can leave them in:

In [198]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

<font color='blue'>reset_index</font> does the opposite of set_index; the hiearchical index levels are moved into columns:

In [199]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1